tutorials/rasInterFoam/damBreak/0/R
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volSymmTensorField;
    object          R;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    leftWall        
    {
        type            zeroGradient;
    }

    rightWall       
    {
        type            zeroGradient;
    }

    lowerWall       
    {
        type            zeroGradient;
    }

    atmosphere      
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0 0 0 0);
        value           uniform (0 0 0 0 0 0);
    }

    defaultFaces    
    {
        type            empty;
    }
}


// ************************************************************************* //
